{
  "users": [
    {
      "fullName": "Soufiane Belchhab",
      "email": "soufiane@isoufiane.com",
      "salt": "$2a$10$2ggfW285TXVUtaYTZ4AuE.",
      "password": "$2a$10$2ggfW285TXVUtaYTZ4AuE.CagauaIi8a.BLlKtamSOZg/D9GbCec6",
      "createdAt": "Fri Sep 15 2023 05:26:26 GMT+0100 (GMT+01:00)",
      "image": "image-1694751986191-23543992.jpg",
      "id": 1
    },
    {
      "fullName": "Ayman El aouad",
      "email": "aymansep@gmail.com",
      "salt": "$2a$10$xEN3/vpUXPdTd/.JzOvPbO",
      "password": "$2a$10$xEN3/vpUXPdTd/.JzOvPbOfoes9tMr/NZ5XByLXikH0ZRwPhE7MGO",
      "createdAt": "Fri Sep 15 2023 05:35:46 GMT+0100 (GMT+01:00)",
      "image": "image-1694752546358-211792994.jpg",
      "id": 2
    }
  ],
  "blogs": [
    {
      "blogTitle": " What we know about the Morocco earthquake 2024",
      "blogContent": " Nearly 1,500 people have died in the province of Al Haouz, where the quake was most devastating. The region, like emmmmmany other badly affected locations, lies south of Morocco at the foot of the Atlas Mountains, and includes remote villages and settlements that have been difficult for rescuers to reach.\n\nEyewitnesses in the foothills of the mountains said some towns are completely destroyed, with almost all the homes in an area of the village of Asni damaged.\n\nThe scale of the quake’s impact is still becoming clear, but eyewitnesses CNN spoke to gave a sense of the destruction, especially in isolated villages that have been most badly hit. \n\nworking",
      "id": 1
    },
    {
      "blogTitle": " Morocco earthquake: Is it safe to travel and are flights to Marrakech cancelled? 2024",
      "blogContent": " The quake caused buildings to collapse and aftershocks are likely in the region in the coming days.\n\nOn Friday a 6.8 magnitude earthquake hit Morocco killing more than 2,800 people and injuring thousands.\n\nRescue efforts are still ongoing and the death toll is likely to rise as they continue. The epicentre of the quake was around 70 km southwest of Marrakech - a city popular with international visitors.\n\nExperts have said that aftershocks from the earthquake are likely in the region for the next couple of days. At least 25 have already happened since Friday, according to the European-Mediterranean Seismological Centre.\n\nWith thousands of people booked to visit the country this autumn, is it safe to travel to Morocco?",
      "userId": 1,
      "userFullName": "Soufiane Belchhab",
      "userEmail": "me@isoufiane.com",
      "blogImage": "image-1694750705003-147365896.webp",
      "createdAt": "Sep 15, 2023, 5:05 AM",
      "id": 6
    },
    {
      "blogTitle": " NASA team calls for end to UFO stigma as search for proof continues 2023 ",
      "blogContent": " With ever more sightings of so-called 'UAP' being reported by US military personnel, new means for recording and studying them are badly needed.\n\nA new report commissioned by NASA has outlined how the US's space agency can do more to help explain mysterious flying objects spotted around the world, this at a time when theories and claims about extraterrestrial visitations to Earth are suddenly circulating widely once again.\n\nThe paper on Unidentified Anomalous Phenomena, or UAP – the US government's preferred term for what are popularly called UFOs – argues that even though many of the sightings recorded in recent years have since been revealed as nothing out of the ordinary, there remain more than a few that are not explicable with current data.\n\nNASA's role, the authors write, is to use the full spectrum of its technological power to improve monitoring and study of these phenomena – and to lend its unique credibility to an issue where rigorous scientific investigation is still hampered by stigma.\n\n\"The negative perception surrounding the reporting of UAP poses an obstacle to collecting data on these phenomena,\" the report's authors write.\n\n\"NASA’s very involvement in UAP will play a vital role in reducing stigma associated with UAP reporting, which almost certainly leads to data attrition at present. NASA’s long-standing public trust, which is essential for communicating findings about these phenomena to citizens, is crucial for destigmatising UAP reporting.\"",
      "userId": 1,
      "userFullName": "Soufiane Belchhab",
      "userEmail": "soufiane@isoufiane.com",
      "blogImage": "image-1694752404169-777453042.webp",
      "createdAt": "Sep 15, 2023, 5:33 AM",
      "id": 8
    },
    {
      "blogTitle": "10 Articles Java Developers Should Read this Week",
      "blogContent": "Hello guys, curation is one of my passion and so is reading. I read a lot, here in Medium, On Reddit, On HackerNews, and in general other places on the Internet. While reading so many articles I have noticed one thing that sometimes a good article doesn’t get the exposure it deserves and when I see that I feel for them.\r\n\r\nIt takes a lot of hard work, time, and patience to write an article and there is nothing more frustrating to find that only a handful of your friends have read it.\r\n\r\nJava Community has given so much love to me and I am really grateful I felt that I should also do something for new writers and bloggers and Java developers who write and that’s why I have created this\r\nMedium\r\nPublication, Javarevisited.\r\n\r\nIf you follow me that you know that I solely write on my blog Javarevisited and Java67 but in this place, it’s not just me but other Java programmer and developer who also gets a chance to write and share their thoughts.\r\n\r\nApart from that, I have also started a series of curation articles, where I will share some worth reading Java articles from Medium so that you can read some interesting articles and those articles also get more exposure they deserve before falling on the sea.\r\n\r\nSo, here is my first such curated list of best Java articles of this week from Medium:",
      "userId": 2,
      "userFullName": "Soufiane Belchhab",
      "userEmail": "aymansep@gmail.com",
      "blogImage": "image-1694752618196-337034728.jpg",
      "createdAt": "Sep 15, 2023, 5:36 AM",
      "id": 9
    },
    {
      "blogTitle": "Dolorum modi saepe o",
      "blogContent": "Magni maxime est es 2023",
      "userId": 1,
      "userEmail": "soufiane@isoufiane.com",
      "userFullName": "Soufiane Belchhab",
      "blogImage": "",
      "createdAt": "Sep 16, 2023, 11:22 PM",
      "id": 10
    }
  ]
}